[
    {
        "question1": "What startup, acquired by Facebook for $1 billion in 2012, became the fourth most downloaded app in the 2010s and is known for the posting of pictures?",
        "answer1": "Instagram"
    },
    {
        "question2": "What is the programming language developed by James Gosling at Sun Microsystems and named after the type of coffee from Indonesia?",
        "answer2": "Java"
    },
{
        "question3": "Pierre Omidyar founded which popular online auction company in 1995 out of San Jose, California?",
        "answer3": "eBay"
    },
{
        "question4": "In 1999 Shigetaka Kurita invented what keyboard additions for cell phones that would eventually replace emoticons and even get their own movie?",
        "answer4": "Emojis"
    },
{
        "question5": "What word is often abbreviated as Fn on a keyboard?",
        "answer5": "Function"
    },
{
        "question6": "What popular operating system, launched in 1991, also has its own mascot, Tux the penguin?",
        "answer6": "Linux"
    },
{
        "question7": "The first FDA-approved telemedicine robot that uses autonomous movement technology is the RP-VITA, from the Roomba-making firm that shares what name with a Will Smith movie.",
        "answer7": "iRobot"
    },
{
        "question8": "THINK was the company motto for more than 40 years, for the company often referred to as 'Big Blue'. What is this frequently-acronymed company?",
        "answer8": "IBM"
    },
{
        "question9": "What delicious computer term did web browser programmer Lou Montulli coin to refer to information that is sent from the browser to the web server?",
        "answer9": "Cookie"
    },
{
        "question10": "Now appearing prophetic, what device was announced in 2007 with the following slogan? 'This is only the beginning.'",
        "answer10": "iPhone"
    },
{
        "question11": "Developed by Unimation, the Programmable Universal Manipulation Arm is also known by the much shorter name of what fierce animal?",
        "answer11": "PUMA"
    },
{
        "question12": "What is the 6-letter term for a group of computers that is networked together and used by hackers to steal information?",
        "answer12": "Botnet"
    },
{
        "question13": "A dude named Chip Morningstar received the first JSON message, a format derived from what core language repped by the 'JS'?",
        "answer13": "JavaScript"
    },
{
        "question14": "In 2022, Credit Kudos, a credit evaluation tool for lenders based out of the UK, was purchased by what technology giant with a fruit-based name?",
        "answer14": "Apple"
    },
{
        "question15": "Andy Rubin is known as one of the three founders of what massively popular cell phone operating system?",
        "answer15": "Android"
    },
{
        "question16": "What “A” antivirus software is a freeware solution available across multiple platforms, with an amoeba like orange “A” as a logo? It is also a pirate word meaning “Stop.”",
        "answer16": "Avast"
    },
{
        "question17": "Doug Engelbart was the inventor of what computer accessory? The first one was made from wood.",
        "answer17": "Mouse"
    },
{
        "question18": "The four principle wireless encryption standards available at most access points are WPA, WPA2, WPA3, and which less-secure fourth option?",
        "answer18": "WEP"
    },
{
        "question19": "In a 1987 film starring Peter Weller and Nancy Allen, the city of Detroit signs a deal with the company Omni Consumer Products to re-build parts of the city into a utopia and introduce a law enforcement robot ED-209. What is this film?",
        "answer19": "RoboCop"
    },
{
        "question20": "What is the seven-letter branded software standard created by Apple that enables a car radio or touchscreen to be a display and a controller for an iOS device?",
        "answer20": "CarPlay"
    },
{
        "question21": "What American tech company had a microprocessor facility in Costa Rica that at one time was responsible for 20% of Costa Rican exports and 5% of the country's GDP?",
        "answer21": "Intel"
    },
{
        "question22": "What simulation video game franchise was originally developed by Will Wright and launched in 1989 for the Macintosh computer?",
        "answer22": "SimCity"
    },
{
        "question23": "Composed for solo guitar by Francisco Tárrega in 1902, 'Grand Valse' is used as the distinctive ringtone of what Nordic telecom?",
        "answer23": "Nokia"
    },
{
        "question24": "In 2005, Linus Torvalds created software for tracking changes on files in order to improve development of the Linux kernel. Since 2005, the open-source software has had Junio Hamano as the core maintainer. What is the three-letter name of this uber-popular software among developers?",
        "answer24": "Git"
    },
{
        "question25": "What Japanese-based conglomerate used 'That '70s Show' star Ashton Kutcher to promote its Coolpix digital camera in a 2009 commercial?",
        "answer25": "Nikon"
    },
{
        "question26": "Tony Stark tries on his magnanimous dude persona at the start of 'Captain America: Civil War' by funding all student projects at what New England school?",
        "answer26": "MIT"
    },
{
        "question27": "Unicode, the standard for character encoding used to represent multilingual text as binary, is the successor of what US encoding standard?",
        "answer27": "ASCII"
    },
{
        "question28": "What company providing hosting for software development and distributed version control familiar to computer programmers is known for its iconic Octocat (part cat, part octopus) logo?",
        "answer28": "Github"
    },
{
        "question29": "A November 1998 article titled 'New CYBERSCAPE: Digital Assistants Get Sophisticated' was the first article in the New York Times's archive to use what now-ubiquitous word which, despite its name, does not necessarily refer to the IQ of a pocket computer?",
        "answer29": "Smartphone"
    },
{
        "question30": "Your computer is switching to a different _____ when you receive an HTTP code 101. What word fills in the blank?",
        "answer30": "Protocol"
    },
{
        "question31": "Maker of devices such as Nintendo gaming consoles, iPhones, and Amazon Kindle, the Taiwanese manufacturer Hon Hai Technology Group is better known by what 'sly' name?",
        "answer31": "Foxconn"
    },
{
        "question32": "What multinational technology and internet company, owner of Fitbit, launched its own Finance website in 2006, tracking stocks and earnings along with financial news?",
        "answer32": "Google"
    },
{
        "question33": "What company's mid 1960's 'Drafting System' is often considered a tipping point in revealing the benefits of computer-aided design (CAD)?",
        "answer33": "IBM"
    },
{
        "question34": "Officially announced in February 2019, the 'Mate X' folding cell phone will be manufactured and sold by what electronics giant?",
        "answer34": "Huawei"
    }
]